import Image from "next/image";
import Layout from "../../components/layouts/aboutus-layout";

export default function SingleNews() {
  return (
    <main className="max-w-5xl mx-auto px-4 md:px-0 py-10">
      <div className="bg-white rounded-3xl">
        <div className="px-8 pt-6 pb-2">
          <h1 className="text-xl text-black">
            تیتر یه خبر بسیار مهم که باید به آن به توجه کرد.
          </h1>
          <span className="text-gray-400">زیر تیتر این خبر مهم</span>
        </div>
        <div className="mx-auto relative h-96">
          <Image
            alt="عبدالهیان"
            src="/tempImgs/4.jpg"
            layout="fill"
            objectFit="cover"
          />
        </div>
        <div className="newsContainer pt-5 pb-16 px-4 md:px-16">
          <p>
            یکی از مسائلی که در رابطه با آلودگی‌های محیط زیستی مشکل‌ساز است
            رنگ‌های مورداستفاده در صنایع مختلف‌اند که در طیفی گسترده وارد
            محیط‌زیست ازجمله آب می‌شود و آلودگی‌های تجزیه‌ناپذیری را ایجاد
            می‌کنند. از راهکارهای حذف این آلودگی‌ها از محیط‌زیست استفاده می‌شود،
            می‌توان به بهره‌گیری از اثر جذب از طریق افزودنی‌های جاذبی مثل کربن
            اشاره کرد اما یکی از موانع در استفاده از اثر جذب نبودن مسیری امن و
            یک‌بارمصرف بودن مواد افزودنی است. محققان دانشگاه چنک کونگ تایوان
            راه‌حلی برای تصفیه فاضلاب از طریق استفاده از نانو کامپوزیت‌ها را
            مطرح می‌کنند. این مقاله در شماره 421 مجله Hazardous Materials در 5
            ژانویه 2022 منتشرشده است. CMC یک پلیمر با مشخصه و ارزان‌قیمت است که
            از سلولز طبیعی مشتق شده است، یک پلیمر فراوان که در گیاهان و ریز
            جلبک‌ها یافت می‌شوند. در این مطالعه، محققان CMC را با PAA – یک پلیمر
            آب‌دوست، غیر سمی و ایمن – ترکیب کردند و هیدروژل‌های حاصل را با اکسید
            گرافن بارگذاری کردند. درنهایت، با قرار دادن این هیدروژل‌ها در
            چرخه‌های مکرر شستشو و خشک‌کردن انجمادی، هیدروژل‌ها را به “آئروژل”
            تبدیل کردند، که شبکه‌های جامد متخلخل حاوی حباب‌های هوا هستند که
            ظرفیت جذب بالایی دارند. تیم تحقیقاتی آئروژل‌ها را با استفاده از
            میکروسکوپ الکترونیکی روبشی گسیل میدانی و تکنیک‌های آزمایشگاهی مشخص
            کردند و دریافتند که سطوح مختلف اکسید گرافن منافذ با اندازه‌های
            متفاوتی را در آئروژل ایجاد می‌کند. آن‌ها دریافتند که افزودن اکسید
            گرافن باعث افزایش سطح ویژه و پایداری حرارتی هیدروژل‌های
            نانوکامپوزیتی می‌شود. آن‌ها همچنین مشاهده کردند که اندازه منافذ
            هیدروژل‌ها با افزایش غلظت اکسید گرافن کاهش می‌یابد. علاوه بر این،
            آئروژل توسعه‌یافته در این مطالعه دارای قابلیت جذب بود ظرفیت 138
            میلی‌گرم بر گرم متیلن بلو پس از 250 دقیقه – که یکی از بالاترین
            ظرفیت‌های جذب متیلن بلو گزارش‌شده است. درنهایت، محققان مشاهده کردند
            که هیدروژل‌های جدید حدود 90 درصد از ظرفیت جذب خود را حتی پس از 9
            دوره استفاده و بازسازی حفظ می‌کنند. به گفته پروفسور چن،پروفسور
            دانشگاه چنگ کونگ، این جاذب توسعه‌یافته در این مطالعه هم سازگار با
            محیط‌زیست و هم مقرون‌به‌صرفه است، که نشان‌دهنده پتانسیل کاربرد بالای
            آن برای حذف رنگ‌های کاتیونی از آب و فاضلاب است. منبع: www.phys.org
          </p>
          <p>
            محققان دانشگاه چنک کونگ تایوان راه‌حلی برای تصفیه فاضلاب از طریق
            استفاده از نانو کامپوزیت‌ها را مطرح می‌کنند. این مقاله در شماره 421
            مجله Hazardous Materials در 5 ژانویه 2022 منتشرشده است.
          </p>
          <p>
            CMC یک پلیمر با مشخصه و ارزان‌قیمت است که از سلولز طبیعی مشتق شده
            است، یک پلیمر فراوان که در گیاهان و ریز جلبک‌ها یافت می‌شوند.
          </p>
          <p>
            در این مطالعه، محققان CMC را با PAA – یک پلیمر آب‌دوست، غیر سمی و
            ایمن – ترکیب کردند و هیدروژل‌های حاصل را با اکسید گرافن بارگذاری
            کردند. درنهایت، با قرار دادن این هیدروژل‌ها در چرخه‌های مکرر شستشو و
            خشک‌کردن انجمادی، هیدروژل‌ها را به “آئروژل” تبدیل کردند، که شبکه‌های
            جامد متخلخل حاوی حباب‌های هوا هستند که ظرفیت جذب بالایی دارند.
          </p>
          <p>
            تیم تحقیقاتی آئروژل‌ها را با استفاده از میکروسکوپ الکترونیکی روبشی
            گسیل میدانی و تکنیک‌های آزمایشگاهی مشخص کردند و دریافتند که سطوح
            مختلف اکسید گرافن منافذ با اندازه‌های متفاوتی را در آئروژل ایجاد
            می‌کند. آن‌ها دریافتند که افزودن اکسید گرافن باعث افزایش سطح ویژه و
            پایداری حرارتی هیدروژل‌های نانوکامپوزیتی می‌شود. آن‌ها همچنین مشاهده
            کردند که اندازه منافذ هیدروژل‌ها با افزایش غلظت اکسید گرافن کاهش
            می‌یابد. علاوه بر این، آئروژل توسعه‌یافته در این مطالعه دارای قابلیت
            جذب بود ظرفیت 138 میلی‌گرم بر گرم متیلن بلو پس از 250 دقیقه – که یکی
            از بالاترین ظرفیت‌های جذب متیلن بلو گزارش‌شده است. درنهایت، محققان
            مشاهده کردند که هیدروژل‌های جدید حدود 90 درصد از ظرفیت جذب خود را
            حتی پس از 9 دوره استفاده و بازسازی حفظ می‌کنند.
          </p>
        </div>
      </div>
    </main>
  );
}

SingleNews.getLayout = function getLayout(page) {
  return <Layout>{page}</Layout>;
};
