import Image from "next/image";
import React from "react";
import AboutUsLayout from "../../components/layouts/aboutus-layout";
import logo from "../../assets/images/abdln_f.png";

export default function AboutUs() {
  return (
    <main dir="rtl" className="h-full w-full">
      <div className="max-w-5xl mx-auto w-full">
        <div className="min-h-[600px] mb-6 bg-white/50 rounded-3xl px-6 py-10">
          <div className="flex justify-center">
            <Image
              alt="گروه بازرگانی عبدالهیان"
              src={logo}
              height="150px"
              width="300px"
            />
          </div>
          <div>
            <p className="px-4 text-lg mt-10 text-justify">
              بازرگانی عبدالهیان با بیش از سیزده سال تجربه در حوزه واردات مواد
              شیمیایی توانسته یکی از مهم‌ترین واردکنندگان کشور در بین
              تامین‌کنندگان مواد اولیه صنایع مختلف باشد. بازرگانی عبدالهیان
              همواره در تلاش بوده تا با تیمی متشکل از مدیران موفق این صنعت و
              جوانان نخبه همه جوانب این صنعت را مورد توجه قرار دهد. ما در تیم
              بازرگانی عبدالهیان با درنظر گرفتن تمامی جوانب سعی در ارتقا سطح
              تجارت مواد اولیه داریم تا در کوتاه‌ترین زمان بهترین کالا با
              بالاترین کیفیت را در اختیار مشتریان خود قرار دهیم و در مسیر پیشرفت
              روابط، پشتیبانی همه جانبه از آن ها به عمل بیاوریم. هدف ما در این
              مجموعه ارتقا استانداردها در ارائه خدمات بازرگانی و تامین مواد
              اولیه صنایع مختلف است. ما «گروه بازرگانی عبدالهیان» با هدف تامین
              به موقع کالای با کیفیت برای مشتریان از سال ۱۳۷۴ فعالیت خود را در
              زمینه واردات و پخش قطعات الکترونیکی و صنعتی آغاز کردیم. از سال
              ۱۳۷۹ حوزه فعالیت‌مان را با واردات خاک‌های صنعتی از Celite محصول
              شرکت World Minerals در زمینه مواد معدنی و شیمیایی گسترش دادیم. سال
              ۱۳۸۷ متمرکز‌تر و تخصصی در زمینه افزودنی‌های کمک تصفیه و ضد رسوب هم
              وارد شدیم و در حال حاضر نماینده شرکت‌های زیر در ایران هستیم:
              شرکت‌های بین‌المللی Hudson شرکت Imerys فرانسه شرکت Skywalker شرکت
              Shanghai Activated Carbon شرکت Shengyang Mehco شرکت Celotech شرکت
              Fenghong بیشتر مشتریان ما صنایع روغن نباتی، کارخانه‌های تولید
              نوشیدنی‌ و مواد غذایی، صنایع رنگ و پوشش‌های صنعتی و تولیدکنندگان
              انواع ملات‌های ساختمانی هستند. ما همواره تلاش می‌کنیم تا
              استانداردهای کیفیت مواد مصرفی را بهبود ببخشیم و تجربه‌ای در کلاس
              جهانی به مشتریان‌شمان ارائه دهیم. به همین منظور در تلاشیم تا با
              وجود موانع و سختی های این راه با بهترین تامین کنندگان دنیا در
              تعامل باشیم و بهترین مواد اولیه را از سراسر دنیا برای صنایع داخلی
              فراهم آوریم.
            </p>
          </div>
        </div>
      </div>
    </main>
  );
}

AboutUs.getLayout = function getLayout(page) {
  return <AboutUsLayout>{page}</AboutUsLayout>;
};
